###################################################################

# Created by write_sdc on Tue Jan 18 23:55:58 2022

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_operating_conditions -max slow -max_library slow\
                         -min fast -min_library fast
set_wire_load_model -name tsmc13_wl10 -library slow
set_load -pin_load 1 [get_ports ready]
set_load -pin_load 1 [get_ports {dout[15]}]
set_load -pin_load 1 [get_ports {dout[14]}]
set_load -pin_load 1 [get_ports {dout[13]}]
set_load -pin_load 1 [get_ports {dout[12]}]
set_load -pin_load 1 [get_ports {dout[11]}]
set_load -pin_load 1 [get_ports {dout[10]}]
set_load -pin_load 1 [get_ports {dout[9]}]
set_load -pin_load 1 [get_ports {dout[8]}]
set_load -pin_load 1 [get_ports {dout[7]}]
set_load -pin_load 1 [get_ports {dout[6]}]
set_load -pin_load 1 [get_ports {dout[5]}]
set_load -pin_load 1 [get_ports {dout[4]}]
set_load -pin_load 1 [get_ports {dout[3]}]
set_load -pin_load 1 [get_ports {dout[2]}]
set_load -pin_load 1 [get_ports {dout[1]}]
set_load -pin_load 1 [get_ports {dout[0]}]
set_max_fanout 20 [get_ports {din[15]}]
set_max_fanout 20 [get_ports {din[14]}]
set_max_fanout 20 [get_ports {din[13]}]
set_max_fanout 20 [get_ports {din[12]}]
set_max_fanout 20 [get_ports {din[11]}]
set_max_fanout 20 [get_ports {din[10]}]
set_max_fanout 20 [get_ports {din[9]}]
set_max_fanout 20 [get_ports {din[8]}]
set_max_fanout 20 [get_ports {din[7]}]
set_max_fanout 20 [get_ports {din[6]}]
set_max_fanout 20 [get_ports {din[5]}]
set_max_fanout 20 [get_ports {din[4]}]
set_max_fanout 20 [get_ports {din[3]}]
set_max_fanout 20 [get_ports {din[2]}]
set_max_fanout 20 [get_ports {din[1]}]
set_max_fanout 20 [get_ports {din[0]}]
set_max_fanout 20 [get_ports reset]
set_max_fanout 20 [get_ports clk]
set_ideal_network [get_ports clk]
create_clock [get_ports clk]  -period 50  -waveform {0 25}
set_clock_latency 0.5  [get_clocks clk]
set_clock_uncertainty 0.1  [get_clocks clk]
set_clock_transition -min -fall 0.1 [get_clocks clk]
set_clock_transition -min -rise 0.1 [get_clocks clk]
set_clock_transition -max -fall 0.1 [get_clocks clk]
set_clock_transition -max -rise 0.1 [get_clocks clk]
set_input_delay -clock clk  -clock_fall  5  [get_ports {din[15]}]
set_input_delay -clock clk  -clock_fall  5  [get_ports {din[14]}]
set_input_delay -clock clk  -clock_fall  5  [get_ports {din[13]}]
set_input_delay -clock clk  -clock_fall  5  [get_ports {din[12]}]
set_input_delay -clock clk  -clock_fall  5  [get_ports {din[11]}]
set_input_delay -clock clk  -clock_fall  5  [get_ports {din[10]}]
set_input_delay -clock clk  -clock_fall  5  [get_ports {din[9]}]
set_input_delay -clock clk  -clock_fall  5  [get_ports {din[8]}]
set_input_delay -clock clk  -clock_fall  5  [get_ports {din[7]}]
set_input_delay -clock clk  -clock_fall  5  [get_ports {din[6]}]
set_input_delay -clock clk  -clock_fall  5  [get_ports {din[5]}]
set_input_delay -clock clk  -clock_fall  5  [get_ports {din[4]}]
set_input_delay -clock clk  -clock_fall  5  [get_ports {din[3]}]
set_input_delay -clock clk  -clock_fall  5  [get_ports {din[2]}]
set_input_delay -clock clk  -clock_fall  5  [get_ports {din[1]}]
set_input_delay -clock clk  -clock_fall  5  [get_ports {din[0]}]
set_input_delay -clock clk  -clock_fall  5  [get_ports reset]
set_output_delay -clock clk  -clock_fall  0.5  [get_ports ready]
set_output_delay -clock clk  -clock_fall  0.5  [get_ports {dout[15]}]
set_output_delay -clock clk  -clock_fall  0.5  [get_ports {dout[14]}]
set_output_delay -clock clk  -clock_fall  0.5  [get_ports {dout[13]}]
set_output_delay -clock clk  -clock_fall  0.5  [get_ports {dout[12]}]
set_output_delay -clock clk  -clock_fall  0.5  [get_ports {dout[11]}]
set_output_delay -clock clk  -clock_fall  0.5  [get_ports {dout[10]}]
set_output_delay -clock clk  -clock_fall  0.5  [get_ports {dout[9]}]
set_output_delay -clock clk  -clock_fall  0.5  [get_ports {dout[8]}]
set_output_delay -clock clk  -clock_fall  0.5  [get_ports {dout[7]}]
set_output_delay -clock clk  -clock_fall  0.5  [get_ports {dout[6]}]
set_output_delay -clock clk  -clock_fall  0.5  [get_ports {dout[5]}]
set_output_delay -clock clk  -clock_fall  0.5  [get_ports {dout[4]}]
set_output_delay -clock clk  -clock_fall  0.5  [get_ports {dout[3]}]
set_output_delay -clock clk  -clock_fall  0.5  [get_ports {dout[2]}]
set_output_delay -clock clk  -clock_fall  0.5  [get_ports {dout[1]}]
set_output_delay -clock clk  -clock_fall  0.5  [get_ports {dout[0]}]
set_drive 0.1  [get_ports {din[15]}]
set_drive 0.1  [get_ports {din[14]}]
set_drive 0.1  [get_ports {din[13]}]
set_drive 0.1  [get_ports {din[12]}]
set_drive 0.1  [get_ports {din[11]}]
set_drive 0.1  [get_ports {din[10]}]
set_drive 0.1  [get_ports {din[9]}]
set_drive 0.1  [get_ports {din[8]}]
set_drive 0.1  [get_ports {din[7]}]
set_drive 0.1  [get_ports {din[6]}]
set_drive 0.1  [get_ports {din[5]}]
set_drive 0.1  [get_ports {din[4]}]
set_drive 0.1  [get_ports {din[3]}]
set_drive 0.1  [get_ports {din[2]}]
set_drive 0.1  [get_ports {din[1]}]
set_drive 0.1  [get_ports {din[0]}]
set_drive 0.1  [get_ports reset]
set_drive 0.1  [get_ports clk]
